## Staging: lambdas
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 12 to add, 3 to change, 12 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                       NAME                                        |
|----------|-----------------------------------------------------------------------------------|
| delete   | `aws_cloudwatch_event_rule.cron_2am_every_day`                                    |
|          | `aws_cloudwatch_event_rule.cron_3am_every_day`                                    |
|          | `aws_cloudwatch_event_rule.cron_4am_every_day`                                    |
|          | `aws_cloudwatch_event_rule.cron_5am_every_business_day`                           |
|          | `aws_cloudwatch_event_target.run_archive_form_responses_lambda_every_day`         |
|          | `aws_cloudwatch_event_target.run_archive_form_templates_lambda_every_day`         |
|          | `aws_cloudwatch_event_target.run_dead_letter_queue_consumer_lambda_every_day`     |
|          | `aws_cloudwatch_event_target.run_nagware_lambda_every_day`                        |
| update   | `aws_lambda_function.nagware`                                                     |
|          | `aws_lambda_function.vault_integrity`                                             |
|          | `aws_s3_object.nagware_code`                                                      |
| recreate | `aws_lambda_permission.allow_cloudwatch_to_run_archive_form_responses_lambda`     |
|          | `aws_lambda_permission.allow_cloudwatch_to_run_dead_letter_queue_consumer_lambda` |
|          | `aws_lambda_permission.allow_cloudwatch_to_run_form_archiver_lambda`              |
|          | `aws_lambda_permission.allow_cloudwatch_to_run_nagware_lambda`                    |
| add      | `aws_cloudwatch_event_rule.form_archiver_lambda_trigger`                          |
|          | `aws_cloudwatch_event_rule.nagware_lambda_trigger`                                |
|          | `aws_cloudwatch_event_rule.reliability_dlq_lambda_trigger`                        |
|          | `aws_cloudwatch_event_rule.response_archiver_lambda_trigger`                      |
|          | `aws_cloudwatch_event_target.form_archiver_lambda_trigger`                        |
|          | `aws_cloudwatch_event_target.nagware_lambda_trigger`                              |
|          | `aws_cloudwatch_event_target.reliability_dlq_lambda_trigger`                      |
|          | `aws_cloudwatch_event_target.response_archiver_lambda_trigger`                    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.cron_2am_every_day will be destroyed
  # (because aws_cloudwatch_event_rule.cron_2am_every_day is not in configuration)
  - resource "aws_cloudwatch_event_rule" "cron_2am_every_day" {
      - arn                 = "arn:aws:events:ca-central-1:687401027353:rule/every-day-at-2am" -> null
      - description         = "Fires every day at 2am EST" -> null
      - event_bus_name      = "default" -> null
      - id                  = "every-day-at-2am" -> null
      - is_enabled          = true -> null
      - name                = "every-day-at-2am" -> null
      - schedule_expression = "cron(0 7 * * ? *)" -> null
      - state               = "ENABLED" -> null
      - tags                = {} -> null
      - tags_all            = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
    }

  # aws_cloudwatch_event_rule.cron_3am_every_day will be destroyed
  # (because aws_cloudwatch_event_rule.cron_3am_every_day is not in configuration)
  - resource "aws_cloudwatch_event_rule" "cron_3am_every_day" {
      - arn                 = "arn:aws:events:ca-central-1:687401027353:rule/every-day-at-3am" -> null
      - description         = "Fires every day at 3am EST" -> null
      - event_bus_name      = "default" -> null
      - id                  = "every-day-at-3am" -> null
      - is_enabled          = true -> null
      - name                = "every-day-at-3am" -> null
      - schedule_expression = "cron(0 8 * * ? *)" -> null
      - state               = "ENABLED" -> null
      - tags                = {} -> null
      - tags_all            = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
    }

  # aws_cloudwatch_event_rule.cron_4am_every_day will be destroyed
  # (because aws_cloudwatch_event_rule.cron_4am_every_day is not in configuration)
  - resource "aws_cloudwatch_event_rule" "cron_4am_every_day" {
      - arn                 = "arn:aws:events:ca-central-1:687401027353:rule/every-day-at-4am" -> null
      - description         = "Fires every day at 4am EST" -> null
      - event_bus_name      = "default" -> null
      - id                  = "every-day-at-4am" -> null
      - is_enabled          = true -> null
      - name                = "every-day-at-4am" -> null
      - schedule_expression = "cron(0 9 * * ? *)" -> null
      - state               = "ENABLED" -> null
      - tags                = {} -> null
      - tags_all            = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
    }

  # aws_cloudwatch_event_rule.cron_5am_every_business_day will be destroyed
  # (because aws_cloudwatch_event_rule.cron_5am_every_business_day is not in configuration)
  - resource "aws_cloudwatch_event_rule" "cron_5am_every_business_day" {
      - arn                 = "arn:aws:events:ca-central-1:687401027353:rule/every-business-day-at-5am" -> null
      - description         = "Fires every business day at 5am EST" -> null
      - event_bus_name      = "default" -> null
      - id                  = "every-business-day-at-5am" -> null
      - is_enabled          = true -> null
      - name                = "every-business-day-at-5am" -> null
      - schedule_expression = "cron(0 10 ? * MON-FRI *)" -> null
      - state               = "ENABLED" -> null
      - tags                = {} -> null
      - tags_all            = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
    }

  # aws_cloudwatch_event_rule.form_archiver_lambda_trigger will be created
  + resource "aws_cloudwatch_event_rule" "form_archiver_lambda_trigger" {
      + arn                 = (known after apply)
      + description         = "Fires every day at 4am EST"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + name                = "form-archiver-lambda-trigger"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 9 * * ? *)"
      + tags_all            = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_event_rule.nagware_lambda_trigger will be created
  + resource "aws_cloudwatch_event_rule" "nagware_lambda_trigger" {
      + arn                 = (known after apply)
      + description         = "Fires every Tuesday, Thursday and Sunday at 5am EST"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + name                = "nagware-lambda-trigger"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 10 * * TUE,THU,SUN *)"
      + tags_all            = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_event_rule.reliability_dlq_lambda_trigger will be created
  + resource "aws_cloudwatch_event_rule" "reliability_dlq_lambda_trigger" {
      + arn                 = (known after apply)
      + description         = "Fires every day at 2am EST"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + name                = "reliability-dlq-lambda-trigger"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 7 * * ? *)"
      + tags_all            = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_event_rule.response_archiver_lambda_trigger will be created
  + resource "aws_cloudwatch_event_rule" "response_archiver_lambda_trigger" {
      + arn                 = (known after apply)
      + description         = "Fires every day at 3am EST"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + name                = "response-archiver-lambda-trigger"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 8 * * ? *)"
      + tags_all            = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_event_target.form_archiver_lambda_trigger will be created
  + resource "aws_cloudwatch_event_target" "form_archiver_lambda_trigger" {
      + arn            = "arn:aws:lambda:ca-central-1:687401027353:function:Archive_Form_Templates"
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "form-archiver-lambda-trigger"
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_event_target.nagware_lambda_trigger will be created
  + resource "aws_cloudwatch_event_target" "nagware_lambda_trigger" {
      + arn            = "arn:aws:lambda:ca-central-1:687401027353:function:Nagware"
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "nagware-lambda-trigger"
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_event_target.reliability_dlq_lambda_trigger will be created
  + resource "aws_cloudwatch_event_target" "reliability_dlq_lambda_trigger" {
      + arn            = "arn:aws:lambda:ca-central-1:687401027353:function:Reliability_DLQ_Consumer"
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "reliability-dlq-lambda-trigger"
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_event_target.response_archiver_lambda_trigger will be created
  + resource "aws_cloudwatch_event_target" "response_archiver_lambda_trigger" {
      + arn            = "arn:aws:lambda:ca-central-1:687401027353:function:Response_Archiver"
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "response-archiver-lambda-trigger"
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_event_target.run_archive_form_responses_lambda_every_day will be destroyed
  # (because aws_cloudwatch_event_target.run_archive_form_responses_lambda_every_day is not in configuration)
  - resource "aws_cloudwatch_event_target" "run_archive_form_responses_lambda_every_day" {
      - arn            = "arn:aws:lambda:ca-central-1:687401027353:function:Response_Archiver" -> null
      - event_bus_name = "default" -> null
      - id             = "every-day-at-3am-terraform-2023120721571581470000000e" -> null
      - rule           = "every-day-at-3am" -> null
      - target_id      = "terraform-2023120721571581470000000e" -> null
    }

  # aws_cloudwatch_event_target.run_archive_form_templates_lambda_every_day will be destroyed
  # (because aws_cloudwatch_event_target.run_archive_form_templates_lambda_every_day is not in configuration)
  - resource "aws_cloudwatch_event_target" "run_archive_form_templates_lambda_every_day" {
      - arn            = "arn:aws:lambda:ca-central-1:687401027353:function:Archive_Form_Templates" -> null
      - event_bus_name = "default" -> null
      - id             = "every-day-at-4am-terraform-2023120721571539640000000b" -> null
      - rule           = "every-day-at-4am" -> null
      - target_id      = "terraform-2023120721571539640000000b" -> null
    }

  # aws_cloudwatch_event_target.run_dead_letter_queue_consumer_lambda_every_day will be destroyed
  # (because aws_cloudwatch_event_target.run_dead_letter_queue_consumer_lambda_every_day is not in configuration)
  - resource "aws_cloudwatch_event_target" "run_dead_letter_queue_consumer_lambda_every_day" {
      - arn            = "arn:aws:lambda:ca-central-1:687401027353:function:Reliability_DLQ_Consumer" -> null
      - event_bus_name = "default" -> null
      - id             = "every-day-at-2am-terraform-2023120721571560770000000d" -> null
      - rule           = "every-day-at-2am" -> null
      - target_id      = "terraform-2023120721571560770000000d" -> null
    }

  # aws_cloudwatch_event_target.run_nagware_lambda_every_day will be destroyed
  # (because aws_cloudwatch_event_target.run_nagware_lambda_every_day is not in configuration)
  - resource "aws_cloudwatch_event_target" "run_nagware_lambda_every_day" {
      - arn            = "arn:aws:lambda:ca-central-1:687401027353:function:Nagware" -> null
      - event_bus_name = "default" -> null
      - id             = "every-business-day-at-5am-terraform-2023120721571552610000000c" -> null
      - rule           = "every-business-day-at-5am" -> null
      - target_id      = "terraform-2023120721571552610000000c" -> null
    }

  # aws_lambda_function.nagware will be updated in-place
  ~ resource "aws_lambda_function" "nagware" {
        id                             = "Nagware"
      ~ last_modified                  = "2024-01-12T15:13:35.000+0000" -> (known after apply)
      ~ s3_object_version              = "n2CchU5tzvaGrJ6t8zKWUGLAvN.9tWij" -> (known after apply)
      ~ source_code_hash               = "MiiK5e/6TJjDywdEaAWyRxtz746ExWQdSBcWjBxYyPk=" -> "2ZP5o8tCbep27P53xhm8tjX9DytomL5qhN8DZAlAVhQ="
        tags                           = {}
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "SNS_ERROR_TOPIC_ARN"       = "arn:aws:sns:ca-central-1:687401027353:alert-critical" -> null
                # (10 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.vault_integrity will be updated in-place
  ~ resource "aws_lambda_function" "vault_integrity" {
        id                             = "Vault_Data_Integrity_Check"
      ~ last_modified                  = "2024-01-25T17:03:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "PD5RmSEVjAYMZc1lvfSSn6O3RadR+J09hCPKVbQS/+g=" -> "TowbMcppnki+0a5fq50Oral3CqleiwGw7U1igvFz0Ws="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_permission.allow_cloudwatch_to_run_archive_form_responses_lambda must be replaced
-/+ resource "aws_lambda_permission" "allow_cloudwatch_to_run_archive_form_responses_lambda" {
      ~ id                  = "AllowExecutionFromCloudWatch" -> (known after apply)
      ~ source_arn          = "arn:aws:events:ca-central-1:687401027353:rule/every-day-at-3am" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_permission.allow_cloudwatch_to_run_dead_letter_queue_consumer_lambda must be replaced
-/+ resource "aws_lambda_permission" "allow_cloudwatch_to_run_dead_letter_queue_consumer_lambda" {
      ~ id                  = "AllowExecutionFromCloudWatch" -> (known after apply)
      ~ source_arn          = "arn:aws:events:ca-central-1:687401027353:rule/every-day-at-2am" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_permission.allow_cloudwatch_to_run_form_archiver_lambda must be replaced
-/+ resource "aws_lambda_permission" "allow_cloudwatch_to_run_form_archiver_lambda" {
      ~ id                  = "AllowExecutionFromCloudWatch" -> (known after apply)
      ~ source_arn          = "arn:aws:events:ca-central-1:687401027353:rule/every-day-at-4am" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_permission.allow_cloudwatch_to_run_nagware_lambda must be replaced
-/+ resource "aws_lambda_permission" "allow_cloudwatch_to_run_nagware_lambda" {
      ~ id                  = "AllowExecutionFromCloudWatch" -> (known after apply)
      ~ source_arn          = "arn:aws:events:ca-central-1:687401027353:rule/every-business-day-at-5am" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_s3_object.nagware_code will be updated in-place
  ~ resource "aws_s3_object" "nagware_code" {
        id                     = "nagware_code"
      ~ source_hash            = "MiiK5e/6TJjDywdEaAWyRxtz746ExWQdSBcWjBxYyPk=" -> "2ZP5o8tCbep27P53xhm8tjX9DytomL5qhN8DZAlAVhQ="
        tags                   = {}
      ~ version_id             = "n2CchU5tzvaGrJ6t8zKWUGLAvN.9tWij" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

Plan: 12 to add, 3 to change, 12 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.form_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.nagware_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.reliability_dlq_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.response_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.archive_form_templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.dead_letter_queue_consumer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.nagware"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.reliability"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.response_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.submission"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.vault_integrity"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_dynamodb"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_kms"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_logging"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_s3"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_secrets"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_sns"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_sqs"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.audit_logs"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
